package com.diosoft.trsine.calendar.common;
// Создать Event Pojo объект  (в соответстви Builder паттерн):
// должен содержать поле String description
// должен содержать поле List<String> attenders
// должен содержать поле Date date (время евента)
// Cоздать Main класс который будет содержать main  метод принимающий на вход список descriptions для создания событий (Event) и добавляющий их в хранилище. main метод должен заполнять предопределенные событиея списком приглашенных участников (emails)
// Создать класс CallendarService который будет отвечать за создание и обслуживание евентов нашего календаря
// внутри сервиса вы должны содержать хранилище всех событий в виде HashMap
// добавте метод для добавленния события в календарь addEvent(event)
// добавте метод для удобного создания событий createEvent(title, emails)
// добавте метод для поиска события по title Event  searac(title: String)
// функционал должен быть протестирован с помощью юнит тестов
public class Event {
}
